app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      @songs = Artist.find(params[:artist_id]).songs
    else
      flash[:notice] = "Artist not found"
      @songs = Song.all