app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    if !params[:artist_id]
      render 'songs/index'
    elsif params[:artist_id].to_i > 0
      @songs = Artist.find(params[:artist_id]).songs

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
   if @song = Song.find(params[:id])
     @song.artist = Artist.find(params[:artist_id])